CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/startup_hc32f460petb.s
                DCD     IRQ035_Handler

                DCD     IRQ036_Handler

                DCD     IRQ037_Handler

                DCD     IRQ038_Handler

                DCD     IRQ039_Handler

                DCD     IRQ040_Handler

                DCD     IRQ041_Handler

                DCD     IRQ042_Handler

                DCD     IRQ043_Handler

                DCD     IRQ044_Handler

                DCD     IRQ045_Handler

                DCD     IRQ046_Handler

                DCD     IRQ047_Handler

                DCD     IRQ048_Handler

                DCD     IRQ049_Handler

                DCD     IRQ050_Handler

                DCD     IRQ051_Handler

                DCD     IRQ052_Handler

                DCD     IRQ053_Handler

                DCD     IRQ054_Handler

                DCD     IRQ055_Handler

                DCD     IRQ056_Handler

                DCD     IRQ057_Handler

                DCD     IRQ058_Handler

                DCD     IRQ059_Handler

                DCD     IRQ060_Handler

                DCD     IRQ061_Handler

                DCD     IRQ062_Handler

                DCD     IRQ063_Handler

                DCD     IRQ064_Handler

                DCD     IRQ065_Handler

                DCD     IRQ066_Handler

                DCD     IRQ067_Handler

                DCD     IRQ068_Handler

                DCD     IRQ069_Handler

                DCD     IRQ070_Handler

                DCD     IRQ071_Handler

                DCD     IRQ072_Handler

                DCD     IRQ073_Handler

                DCD     IRQ074_Handler

                DCD     IRQ075_Handler

                DCD     IRQ076_Handler

                DCD     IRQ077_Handler

                DCD     IRQ078_Handler

                DCD     IRQ079_Handler

                DCD     IRQ080_Handler

                DCD     IRQ081_Handler

                DCD     IRQ082_Handler

                DCD     IRQ083_Handler

                DCD     IRQ084_Handler

                DCD     IRQ085_Handler

                DCD     IRQ086_Handler

                DCD     IRQ087_Handler

                DCD     IRQ088_Handler

                DCD     IRQ089_Handler

                DCD     IRQ090_Handler

                DCD     IRQ091_Handler

                DCD     IRQ092_Handler

                DCD     IRQ093_Handler

                DCD     IRQ094_Handler

                DCD     IRQ095_Handler

                DCD     IRQ096_Handler

                DCD     IRQ097_Handler

                DCD     IRQ098_Handler

                DCD     IRQ099_Handler

                DCD     IRQ100_Handler

                DCD     IRQ101_Handler

                DCD     IRQ102_Handler

                DCD     IRQ103_Handler

                DCD     IRQ104_Handler

                DCD     IRQ105_Handler

                DCD     IRQ106_Handler

                DCD     IRQ107_Handler

                DCD     IRQ108_Handler

                DCD     IRQ109_Handler

                DCD     IRQ110_Handler

                DCD     IRQ111_Handler

                DCD     IRQ112_Handler

                DCD     IRQ113_Handler

                DCD     IRQ114_Handler

                DCD     IRQ115_Handler

                DCD     IRQ116_Handler

                DCD     IRQ117_Handler

                DCD     IRQ118_Handler

                DCD     IRQ119_Handler

                DCD     IRQ120_Handler

                DCD     IRQ121_Handler

                DCD     IRQ122_Handler

                DCD     IRQ123_Handler

                DCD     IRQ124_Handler

                DCD     IRQ125_Handler

                DCD     IRQ126_Handler

                DCD     IRQ127_Handler

                DCD     IRQ128_Handler

                DCD     IRQ129_Handler

                DCD     IRQ130_Handler

                DCD     IRQ131_Handler

                DCD     IRQ132_Handler

                DCD     IRQ133_Handler

                DCD     IRQ134_Handler

                DCD     IRQ135_Handler

                DCD     IRQ136_Handler

                DCD     IRQ137_Handler

                DCD     IRQ138_Handler

                DCD     IRQ139_Handler

                DCD     IRQ140_Handler

                DCD     IRQ141_Handler

                DCD     IRQ142_Handler

                DCD     IRQ143_Handler



                ;reseved for ICG
                FILL    0X1A0, 0XFF, 1

__Vectors_End

__Vectors_Size  EQU     __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY


; Reset Handler

Reset_Handler   PROC
                EXPORT  Reset_Handler             [WEAK]
                IMPORT  SystemInit
                IMPORT  __main

               ;reset NVIC if in rom debug
                LDR     R0, =0x20000000
                LDR     R2, =0x0
                MOVS    R1, #0                 ; for warning,
                ADD     R1, PC,#0              ; for A1609W,
                CMP     R1, R0
                BLS     RAMCODE

              ; ram code base address.
                ADD     R2, R0,R2
RAMCODE
              ; reset Vector table address.
                LDR     R0, =0xE000ED08
                STR     R2, [R0]

                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__main
                BX      R0
                ENDP


; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler     PROC
                EXPORT  NMI_Handler               [WEAK]
                B       .
                ENDP


HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler         [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler         [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler          [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler        [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler               [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler          [WEAK]
                B       .
                ENDP
PendSV_Handler\
                PROC
                EXPORT  PendSV_Handler            [WEAK]
                B       .
                ENDP
SysTick_Handler\
                PROC
                EXPORT  SysTick_Handler           [WEAK]
                B       .
                ENDP

Default_Handler PROC
                EXPORT  IRQ000_Handler                  [WEAK]

                EXPORT  IRQ001_Handler                  [WEAK]

