CrealityOfficial/Ender-2-Pro/source/main/hdsc32core/startup_hc32f460petb.s
                EXPORT  IRQ093_Handler                  [WEAK]

                EXPORT  IRQ094_Handler                  [WEAK]

                EXPORT  IRQ095_Handler                  [WEAK]

                EXPORT  IRQ096_Handler                  [WEAK]

                EXPORT  IRQ097_Handler                  [WEAK]

                EXPORT  IRQ098_Handler                  [WEAK]

                EXPORT  IRQ099_Handler                  [WEAK]

                EXPORT  IRQ100_Handler                  [WEAK]

                EXPORT  IRQ101_Handler                  [WEAK]

                EXPORT  IRQ102_Handler                  [WEAK]

                EXPORT  IRQ103_Handler                  [WEAK]

                EXPORT  IRQ104_Handler                  [WEAK]

                EXPORT  IRQ105_Handler                  [WEAK]

                EXPORT  IRQ106_Handler                  [WEAK]

                EXPORT  IRQ107_Handler                  [WEAK]

                EXPORT  IRQ108_Handler                  [WEAK]

                EXPORT  IRQ109_Handler                  [WEAK]

                EXPORT  IRQ110_Handler                  [WEAK]

                EXPORT  IRQ111_Handler                  [WEAK]

                EXPORT  IRQ112_Handler                  [WEAK]

                EXPORT  IRQ113_Handler                  [WEAK]

                EXPORT  IRQ114_Handler                  [WEAK]

                EXPORT  IRQ115_Handler                  [WEAK]

                EXPORT  IRQ116_Handler                  [WEAK]

                EXPORT  IRQ117_Handler                  [WEAK]

                EXPORT  IRQ118_Handler                  [WEAK]

                EXPORT  IRQ119_Handler                  [WEAK]

                EXPORT  IRQ120_Handler                  [WEAK]

                EXPORT  IRQ121_Handler                  [WEAK]

                EXPORT  IRQ122_Handler                  [WEAK]

                EXPORT  IRQ123_Handler                  [WEAK]

                EXPORT  IRQ124_Handler                  [WEAK]

                EXPORT  IRQ125_Handler                  [WEAK]

                EXPORT  IRQ126_Handler                  [WEAK]

                EXPORT  IRQ127_Handler                  [WEAK]

                EXPORT  IRQ128_Handler                  [WEAK]

                EXPORT  IRQ129_Handler                  [WEAK]

                EXPORT  IRQ130_Handler                  [WEAK]

                EXPORT  IRQ131_Handler                  [WEAK]

                EXPORT  IRQ132_Handler                  [WEAK]

                EXPORT  IRQ133_Handler                  [WEAK]

                EXPORT  IRQ134_Handler                  [WEAK]

                EXPORT  IRQ135_Handler                  [WEAK]

                EXPORT  IRQ136_Handler                  [WEAK]

                EXPORT  IRQ137_Handler                  [WEAK]

                EXPORT  IRQ138_Handler                  [WEAK]

                EXPORT  IRQ139_Handler                  [WEAK]

                EXPORT  IRQ140_Handler                  [WEAK]

                EXPORT  IRQ141_Handler                  [WEAK]

                EXPORT  IRQ142_Handler                  [WEAK]

                EXPORT  IRQ143_Handler                  [WEAK]

IRQ000_Handler

IRQ001_Handler

IRQ002_Handler

IRQ003_Handler

IRQ004_Handler

IRQ005_Handler

IRQ006_Handler

IRQ007_Handler

IRQ008_Handler

IRQ009_Handler

IRQ010_Handler

IRQ011_Handler

IRQ012_Handler

IRQ013_Handler

IRQ014_Handler

IRQ015_Handler

IRQ016_Handler

IRQ017_Handler

IRQ018_Handler

IRQ019_Handler

IRQ020_Handler

IRQ021_Handler

IRQ022_Handler

IRQ023_Handler

IRQ024_Handler

IRQ025_Handler

IRQ026_Handler

IRQ027_Handler

IRQ028_Handler

IRQ029_Handler

IRQ030_Handler

IRQ031_Handler

IRQ032_Handler

IRQ033_Handler

IRQ034_Handler

IRQ035_Handler

IRQ036_Handler

IRQ037_Handler

IRQ038_Handler

IRQ039_Handler

IRQ040_Handler

IRQ041_Handler

IRQ042_Handler

IRQ043_Handler

IRQ044_Handler

IRQ045_Handler

IRQ046_Handler

IRQ047_Handler

IRQ048_Handler

IRQ049_Handler

IRQ050_Handler

IRQ051_Handler

IRQ052_Handler

IRQ053_Handler

IRQ054_Handler

IRQ055_Handler

IRQ056_Handler

IRQ057_Handler

IRQ058_Handler

IRQ059_Handler

IRQ060_Handler

IRQ061_Handler

IRQ062_Handler

IRQ063_Handler

IRQ064_Handler

IRQ065_Handler

IRQ066_Handler

IRQ067_Handler

IRQ068_Handler

IRQ069_Handler

IRQ070_Handler

IRQ071_Handler

IRQ072_Handler

IRQ073_Handler

IRQ074_Handler

IRQ075_Handler

IRQ076_Handler

IRQ077_Handler

IRQ078_Handler

IRQ079_Handler

IRQ080_Handler

IRQ081_Handler

IRQ082_Handler

IRQ083_Handler

IRQ084_Handler

IRQ085_Handler

IRQ086_Handler

IRQ087_Handler

IRQ088_Handler

IRQ089_Handler

IRQ090_Handler

IRQ091_Handler

IRQ092_Handler

IRQ093_Handler

IRQ094_Handler

IRQ095_Handler

IRQ096_Handler

IRQ097_Handler

IRQ098_Handler

IRQ099_Handler

IRQ100_Handler

IRQ101_Handler

IRQ102_Handler

IRQ103_Handler

IRQ104_Handler

IRQ105_Handler

IRQ106_Handler

IRQ107_Handler

IRQ108_Handler

IRQ109_Handler

IRQ110_Handler

IRQ111_Handler

IRQ112_Handler

IRQ113_Handler

IRQ114_Handler

IRQ115_Handler

IRQ116_Handler

IRQ117_Handler

IRQ118_Handler

IRQ119_Handler

IRQ120_Handler

IRQ121_Handler

IRQ122_Handler

IRQ123_Handler

IRQ124_Handler

IRQ125_Handler

IRQ126_Handler

IRQ127_Handler

IRQ128_Handler

IRQ129_Handler

IRQ130_Handler

IRQ131_Handler

IRQ132_Handler

IRQ133_Handler

IRQ134_Handler

IRQ135_Handler

IRQ136_Handler

IRQ137_Handler

IRQ138_Handler

IRQ139_Handler

IRQ140_Handler

IRQ141_Handler

IRQ142_Handler

IRQ143_Handler



               B .

                ENDP


                ALIGN


; User Initial Stack & Heap

                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap
__user_initial_stackheap

                LDR     R0, =  Heap_Mem
                LDR     R1, =(Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem +  Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR

                ALIGN

                ENDIF


                END
